xbenkozx/RAZ-RE/Firmware/keil-mdk/firmware/n32g031_std_periph_driver/src/n32g031_rtc.c
    return status;
}

/**
 * @brief  Enables or Disables the Bypass Shadow feature.
 * @note   When the Bypass Shadow is enabled the calendar value are taken
 *         directly from the Calendar counter.
 * @param Cmd new state of the Bypass Shadow feature.
 *         This parameter can be: ENABLE or DISABLE.
 */
void RTC_EnableBypassShadow(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    /* Disable the write protection for RTC registers */
    RTC->WRP = 0xCA;
    RTC->WRP = 0x53;

    if (Cmd != DISABLE)
    {
        /* Set the BYPS bit */
        RTC->CTRL |= (uint8_t)RTC_CTRL_BYPS;
    }
    else
    {
        /* Reset the BYPS bit */
        RTC->CTRL &= (uint8_t)~RTC_CTRL_BYPS;
    }

    /* Enable the write protection for RTC registers */
    RTC->WRP = 0xFF;
}

/**
  * @brief  Calendar initialization configuration.
  * @param RTC_Format: specifies the format of the entered parameters.
  *   This parameter can be one of the following values:
  *     @arg RTC_FORMAT_BIN: Binary data format.
  *     @arg RTC_FORMAT_BCD: BCD data format.
  * @param RTC_InitStruct: pointer to a RTC_InitType structure that contains the configuration
  *         information for the RTC peripheral.When the user does not need to configure this 
  *         parameter, note that NULL can be passed in.
  *   Note: The RTC Prescaler register is write protected and can be written in initialization
  *         mode only.
  * @param RTC_DateStruct: pointer to a RTC_DateType structure that contains the date configuration
  *         information for the RTC.When the user does not need to configure this parameter,
  *         note that NULL can be passed in.
  *   Note: The RTC Date register is write protected and can be written in initialization
  *         mode only.
  * @param RTC_TimeStruct: pointer to a RTC_TimeType structure that contains the time configuration
  *         information for the RTC.When the user does not need to configure this parameter, 
  *         note that NULL can be passed in.
  *   Note: The RTC Time register is write protected and can be written in initialization
  *         mode only.
  * @param  RTC_DelayCmd: Enable or disable 1 second delay.
  *   This parameter can be: ENABLE or DISABLE.
  *   Note: 1. This parameter is configured according to the user's needs. If the user needs
  *         to call this function multiple times within 1 second to configure the calendar, it must
  *         be enabled, because we stipulate that the interval between two calendar configurations 
  *         must be at least 1 second.
  *         2. If this parameter is enabled, We provide two timers to help users complete this delay 
  *			operation (SysTick and TIM6). Users can choose which timer to use according to their needs,
  *			and use the macro RTC_DELAY_USE_TIM6 to select. At the same time, the user should also pay  
  *			attention to the usage of the watchdog. If necessary, the dog can be fed in the interrupt 
  *			handler to prevent the watchdog generating a system reset due to the delay in this function.
  * @return An ErrorStatus enumeration value:
  *         - SUCCESS: RTC PRE register, Date register, Time register is configured
  *         - ERROR: RTC PRE register, Date register, Time register is not configured
  */
ErrorStatus RTC_ConfigCalendar(uint32_t RTC_Format, RTC_InitType* RTC_InitStruct, RTC_DateType* RTC_DateStruct, RTC_TimeType* RTC_TimeStruct, FunctionalState RTC_DelayCmd)
{
	static uint32_t first_init_flag = 1;
	uint32_t tmpregister1 = 0, tmpregister2 = 0;
    ErrorStatus status    = ERROR;
	
    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(RTC_Format));
	
	if(RTC_InitStruct != NULL)
	{
		assert_param(IS_RTC_HOUR_FORMAT(RTC_InitStruct->RTC_HourFormat));
		assert_param(IS_RTC_PREDIV_ASYNCH(RTC_InitStruct->RTC_AsynchPrediv));
		assert_param(IS_RTC_PREDIV_SYNCH(RTC_InitStruct->RTC_SynchPrediv));
	}
	
	if(RTC_DateStruct != NULL)
	{
		if ((RTC_Format == RTC_FORMAT_BIN) && ((RTC_DateStruct->Month & 0x10) == 0x10))
		{
			RTC_DateStruct->Month = (RTC_DateStruct->Month & (uint32_t) ~(0x10)) + 0x0A;
		}
	}
	
    if (RTC_Format == RTC_FORMAT_BIN)
    {
		if(RTC_DateStruct != NULL)
		{
			assert_param(IS_RTC_YEAR(RTC_DateStruct->Year));
			assert_param(IS_RTC_MONTH(RTC_DateStruct->Month));
			assert_param(IS_RTC_DATE(RTC_DateStruct->Date));
			assert_param(IS_RTC_WEEKDAY(RTC_DateStruct->WeekDay));
		}		
		if(RTC_TimeStruct != NULL)
		{
			if(RTC_InitStruct != NULL)
			{
				if(RTC_InitStruct->RTC_HourFormat == RTC_12HOUR_FORMAT)
				{
					assert_param(IS_RTC_12HOUR(RTC_TimeStruct->Hours));
					assert_param(IS_RTC_H12(RTC_TimeStruct->H12));
				}
				else
				{
					RTC_TimeStruct->H12 = RTC_AM_H12;
					assert_param(IS_RTC_24HOUR(RTC_TimeStruct->Hours));
				}
			}
			else
			{
				if ((RTC->CTRL & RTC_CTRL_HFMT) != (uint32_t)RESET)
				{
					assert_param(IS_RTC_12HOUR(RTC_TimeStruct->Hours));
					assert_param(IS_RTC_H12(RTC_TimeStruct->H12));
				}
				else
				{
					RTC_TimeStruct->H12 = RTC_AM_H12;
					assert_param(IS_RTC_24HOUR(RTC_TimeStruct->Hours));
				}
			}
			assert_param(IS_RTC_MINUTES(RTC_TimeStruct->Minutes));
			assert_param(IS_RTC_SECONDS(RTC_TimeStruct->Seconds));
		}
    }
    else
    {
		if(RTC_DateStruct != NULL)
		{
			assert_param(IS_RTC_YEAR(RTC_Bcd2ToByte(RTC_DateStruct->Year)));
			assert_param(IS_RTC_MONTH(RTC_Bcd2ToByte(RTC_DateStruct->Month)));
			assert_param(IS_RTC_DATE(RTC_Bcd2ToByte(RTC_DateStruct->Date)));
			assert_param(IS_RTC_WEEKDAY(RTC_DateStruct->WeekDay));
		}		
		if(RTC_TimeStruct != NULL)
		{
			if(RTC_InitStruct != NULL)
			{
				if(RTC_InitStruct->RTC_HourFormat == RTC_12HOUR_FORMAT)
				{
					assert_param(IS_RTC_12HOUR(RTC_Bcd2ToByte(RTC_TimeStruct->Hours)));
					assert_param(IS_RTC_H12(RTC_TimeStruct->H12));
				}
				else
				{
					RTC_TimeStruct->H12 = RTC_AM_H12;
					assert_param(IS_RTC_24HOUR(RTC_Bcd2ToByte(RTC_TimeStruct->Hours)));
				}
			}
			else
			{
				if ((RTC->CTRL & RTC_CTRL_HFMT) != (uint32_t)RESET)
				{
					assert_param(IS_RTC_12HOUR(RTC_Bcd2ToByte(RTC_TimeStruct->Hours)));
					assert_param(IS_RTC_H12(RTC_TimeStruct->H12));
				}
				else
				{
					RTC_TimeStruct->H12 = RTC_AM_H12;
					assert_param(IS_RTC_24HOUR(RTC_Bcd2ToByte(RTC_TimeStruct->Hours)));
				}				
			}
			assert_param(IS_RTC_MINUTES(RTC_Bcd2ToByte(RTC_TimeStruct->Minutes)));
			assert_param(IS_RTC_SECONDS(RTC_Bcd2ToByte(RTC_TimeStruct->Seconds)));
		}
    }

    /* Check the input parameters format */
    if (RTC_Format != RTC_FORMAT_BIN)
    {
		if(RTC_DateStruct != NULL)
		{
			tmpregister1 = (((uint32_t)(RTC_DateStruct->Year) << 16) | (((uint32_t)RTC_DateStruct->Month) << 8)
			   | ((uint32_t)RTC_DateStruct->Date) | (((uint32_t)RTC_DateStruct->WeekDay) << 13));
		}
		
