xbenkozx/RAZ-RE/Firmware/keil-mdk/firmware/n32g031_std_periph_driver/src/n32g031_rtc.c
		if(RTC_TimeStruct != NULL)
		{
			tmpregister2 = (((uint32_t)(RTC_TimeStruct->Hours) << 16) | ((uint32_t)(RTC_TimeStruct->Minutes) << 8)
			   | ((uint32_t)RTC_TimeStruct->Seconds) | ((uint32_t)(RTC_TimeStruct->H12) << 16));
		}
    }
    else
    {
		if(RTC_DateStruct != NULL)
		{
			tmpregister1 = (((uint32_t)RTC_ByteToBcd2(RTC_DateStruct->Year) << 16)
			   | ((uint32_t)RTC_ByteToBcd2(RTC_DateStruct->Month) << 8)
			   | ((uint32_t)RTC_ByteToBcd2(RTC_DateStruct->Date)) | ((uint32_t)RTC_DateStruct->WeekDay << 13));
		}
		
		if(RTC_TimeStruct != NULL)
		{
			tmpregister2 = (uint32_t)(((uint32_t)RTC_ByteToBcd2(RTC_TimeStruct->Hours) << 16)
			   | ((uint32_t)RTC_ByteToBcd2(RTC_TimeStruct->Minutes) << 8)
			   | ((uint32_t)RTC_ByteToBcd2(RTC_TimeStruct->Seconds)) | (((uint32_t)RTC_TimeStruct->H12) << 16));
		}		
    }

    /* Disable the write protection for RTC registers */
    RTC->WRP = 0xCA;
    RTC->WRP = 0x53;

	if(RTC_DelayCmd == ENABLE)
	{
		/* The first initialization does not execute the delay */
		if(!first_init_flag)
		{
			/* Wait for the 1.1 second delay flag to be set */
			while(!RTC_Delay_Flag);
			RTC_Delay_Flag = 0;
		}
	}
		
    /* Set Initialization mode */
    if (RTC_EnterInitMode() == ERROR)
    {
        status = ERROR;
    }
    else
    {
		if(RTC_InitStruct != NULL)
		{
			/* Clear RTC CTRL HFMT Bit */
			RTC->CTRL &= ((uint32_t) ~(RTC_CTRL_HFMT));
			/* Set RTC_CTRL register */
			RTC->CTRL |= ((uint32_t)(RTC_InitStruct->RTC_HourFormat));

			/* Configure the RTC PRE */
			RTC->PRE = (uint32_t)(RTC_InitStruct->RTC_SynchPrediv);
			RTC->PRE |= (uint32_t)(RTC_InitStruct->RTC_AsynchPrediv << 16);
		}
		
		if(RTC_DateStruct != NULL)
		{
			/* Set the RTC_DATE register */
			RTC->DATE = (uint32_t)(tmpregister1 & RTC_DATE_RESERVED_MASK);
		}

		if(RTC_TimeStruct != NULL)
		{
			/* Set the RTC_TSH register */
			RTC->TSH = (uint32_t)(tmpregister2 & RTC_TR_RESERVED_MASK);
		}
		
        /* Exit Initialization mode */
        RTC_ExitInitMode();	

        /* If  RTC_CTRL_BYPS bit = 0, wait for synchro else this check is not needed */
        if ((RTC->CTRL & RTC_CTRL_BYPS) == RESET)
        {
            if (RTC_WaitForSynchro() == ERROR)
            {
                status = ERROR;
            }
            else
            {
                status = SUCCESS;
            }
        }
        else
        {
            status = SUCCESS;
        }
		
		if(RTC_DelayCmd == ENABLE)
		{		
			if(first_init_flag)
			{
				/* Clear the first initialization flag */
				first_init_flag = 0;
			}
			
#ifdef RTC_DELAY_USE_TIM6
			/* Set Interrupt Priority */
			NVIC_SetPriority(LPTIM_TIM6_IRQn, (1<<__NVIC_PRIO_BITS) - 1);
			NVIC->ISER[0] = (1 << ((uint32_t)(LPTIM_TIM6_IRQn) & 0x1F));
			/* Enable the TIM6 clock*/
			RCC->APB1PCLKEN |= RCC_APB1_PERIPH_TIM6;
			RCC->APB1PRST |= RCC_APB1_PERIPH_TIM6;
			RCC->APB1PRST &= ~RCC_APB1_PERIPH_TIM6;
			/* Set the Autoreload value */
			TIM6->AR = RTC_DELAY_1S_RELOAD_VALUE_TIM6;
			/* Prescaler configuration */
			TIM6->PSC = RTC_DELAY_1S_PRESCALER_VALUE_TIM6 - 1;
			/* Set or reset the UG Bit */
			TIM6->EVTGEN = TIM_PSC_RELOAD_MODE_IMMEDIATE;
			/* TIM6 enable update irq */
			TIM6->DINTEN |= TIM_INT_UPDATE;
			/* Clear the flag */
			TIM6->STS &= (uint32_t)~TIM_FLAG_UPDATE;
			/* TIM6 enable counter */
			TIM6->CTRL1 |= TIM_CTRL1_CNTEN;
#else
			/* Set Interrupt Priority */
			NVIC_SetPriority (SysTick_IRQn, (1<<__NVIC_PRIO_BITS) - 1);
			/* set reload register */
			SysTick->LOAD  = (RTC_DELAY_1S_RELOAD_VALUE_SYSTICK & SysTick_LOAD_RELOAD_Msk) - 1;
			/* Load the SysTick Counter Value */
			SysTick->VAL   = 0;
			/* Enable SysTick IRQ and SysTick Timer */
			SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk |
						     SysTick_CTRL_TICKINT_Msk   |
						     SysTick_CTRL_ENABLE_Msk;
#endif
		}
    }
    /* Enable the write protection for RTC registers */
    RTC->WRP = 0xFF;

    return status;
}

/**
 * @}
 */

/** @addtogroup RTC_Group2 Time and Date get functions
 *  @brief   Time and Date get functions
 *
@verbatim
 ===============================================================================
                    ##### Time and Date get functions #####
 ===============================================================================
    [..] This section provide functions allowing to read the RTC Calendar
         (Time and Date).

@endverbatim
  * @{
  */


/**
 * @brief  Fills each RTC_TimeStruct member with its default value
 *         (Time = 00h:00min:00sec).
 * @param RTC_TimeStruct pointer to a RTC_TimeType structure which will be
 *         initialized.
 */
void RTC_TimeStructInit(RTC_TimeType* RTC_TimeStruct)
{
    /* Time = 00h:00min:00sec */
    RTC_TimeStruct->H12     = RTC_AM_H12;
    RTC_TimeStruct->Hours   = 0;
    RTC_TimeStruct->Minutes = 0;
    RTC_TimeStruct->Seconds = 0;
}

/**
 * @brief  Get the RTC current Time.
 * @param RTC_Format specifies the format of the returned parameters.
 *   This parameter can be  one of the following values:
 *     @arg RTC_FORMAT_BIN Binary data format.
 *     @arg RTC_FORMAT_BCD BCD data format.
 * @param RTC_TimeStruct pointer to a RTC_TimeType structure that will
 *                        contain the returned current time configuration.
 */
void RTC_GetTime(uint32_t RTC_Format, RTC_TimeType* RTC_TimeStruct)
{
    uint32_t tmpregister = 0;

    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(RTC_Format));

    /* Get the RTC_TSH register */
    tmpregister = (uint32_t)(RTC->TSH & RTC_TR_RESERVED_MASK);

    /* Fill the structure fields with the read parameters */
    RTC_TimeStruct->Hours   = (uint8_t)((tmpregister & (RTC_TSH_HOT | RTC_TSH_HOU)) >> 16);
    RTC_TimeStruct->Minutes = (uint8_t)((tmpregister & (RTC_TSH_MIT | RTC_TSH_MIU)) >> 8);
    RTC_TimeStruct->Seconds = (uint8_t)(tmpregister & (RTC_TSH_SCT | RTC_TSH_SCU));
    RTC_TimeStruct->H12     = (uint8_t)((tmpregister & (RTC_TSH_APM)) >> 16);

    /* Check the input parameters format */
    if (RTC_Format == RTC_FORMAT_BIN)
    {
        /* Convert the structure parameters to Binary format */
        RTC_TimeStruct->Hours   = (uint8_t)RTC_Bcd2ToByte(RTC_TimeStruct->Hours);
        RTC_TimeStruct->Minutes = (uint8_t)RTC_Bcd2ToByte(RTC_TimeStruct->Minutes);
        RTC_TimeStruct->Seconds = (uint8_t)RTC_Bcd2ToByte(RTC_TimeStruct->Seconds);
    }
	RTC->DATE;
}

/**
 * @brief  Gets the RTC current Calendar Subseconds value.
 * @return RTC current Calendar Subseconds value.
 */
uint32_t RTC_GetSubSecond(void)
{
    uint32_t tmpregister = 0;

